# Используем официальный образ Node.js в качестве базового
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы и директории в рабочую директорию
COPY . .

# Собираем приложение
RUN npm run build

# Устанавливаем переменные окружения
ENV HOST=0.0.0.0
ENV PORT=3000

# Указываем порт, на котором будет работать приложение
EXPOSE 3000

# Запускаем приложение
CMD ["npx", "serve", "-s", "build", "-l", "3000"]
