# Используем официальный образ Node.js в качестве базового
FROM node:lts AS build

# Устанавливаем pnpm
RUN npm install -g pnpm

# Создаем рабочую директорию
WORKDIR /app

# Устанавливаем зависимости
RUN pnpm install

# Копируем остальной исходный код в рабочую директорию
COPY . .

# Собираем приложение
RUN pnpm build

# Создаем рабочую директорию
WORKDIR /app

# Устанавливаем переменные окружения
ENV HOST=0.0.0.0
ENV PORT=3000

# Указываем порт, на котором будет работать приложение
EXPOSE 3000

# Запускаем приложение
CMD ["npx", "serve", "-s", "build", "-l", "3000"]
